results/WR/latency-results-2nodes-wr/500-1000.txt
Running 1m test @ http://west4:3000/1000.txt
  24 threads and 500 connections
  Thread calibration: mean lat.: 5661.670ms, rate sampling interval: 17793ms
  Thread calibration: mean lat.: 5852.728ms, rate sampling interval: 18563ms
  Thread calibration: mean lat.: 5668.764ms, rate sampling interval: 17924ms
  Thread calibration: mean lat.: 5863.326ms, rate sampling interval: 18087ms
  Thread calibration: mean lat.: 5549.397ms, rate sampling interval: 17793ms
  Thread calibration: mean lat.: 5594.665ms, rate sampling interval: 17809ms
  Thread calibration: mean lat.: 6143.271ms, rate sampling interval: 18513ms
  Thread calibration: mean lat.: 5869.377ms, rate sampling interval: 18104ms
  Thread calibration: mean lat.: 5586.115ms, rate sampling interval: 17907ms
  Thread calibration: mean lat.: 5972.567ms, rate sampling interval: 18497ms
  Thread calibration: mean lat.: 6257.664ms, rate sampling interval: 18497ms
  Thread calibration: mean lat.: 5715.353ms, rate sampling interval: 18055ms
  Thread calibration: mean lat.: 5806.080ms, rate sampling interval: 18169ms
  Thread calibration: mean lat.: 6126.859ms, rate sampling interval: 18530ms
  Thread calibration: mean lat.: 5807.706ms, rate sampling interval: 18431ms
  Thread calibration: mean lat.: 6178.950ms, rate sampling interval: 18890ms
  Thread calibration: mean lat.: 5807.823ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 5855.305ms, rate sampling interval: 18464ms
  Thread calibration: mean lat.: 6080.761ms, rate sampling interval: 18481ms
  Thread calibration: mean lat.: 6313.984ms, rate sampling interval: 18497ms
  Thread calibration: mean lat.: 5850.396ms, rate sampling interval: 18464ms
  Thread calibration: mean lat.: 5903.984ms, rate sampling interval: 18513ms
  Thread calibration: mean lat.: 5866.216ms, rate sampling interval: 18153ms
  Thread calibration: mean lat.: 5814.481ms, rate sampling interval: 18382ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.46s    13.48s    0.96m    57.66%
    Req/Sec     3.94      0.24     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.46s 
 75.000%   45.06s 
 90.000%    0.87m 
 99.000%    0.94m 
 99.900%    0.95m 
 99.990%    0.95m 
 99.999%    0.96m 
100.000%    0.96m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9601.023     0.000000            2         1.00
   14942.207     0.100000          522         1.11
   18808.831     0.200000         1044         1.25
   24379.391     0.300000         1565         1.43
   28377.087     0.400000         2086         1.67
   33456.127     0.500000         2609         2.00
   36044.799     0.550000         2871         2.22
   38436.863     0.600000         3128         2.50
   40239.103     0.650000         3397         2.86
   42565.631     0.700000         3653         3.33
   45055.999     0.750000         3912         4.00
   45940.735     0.775000         4042         4.44
   47808.511     0.800000         4177         5.00
   48463.871     0.825000         4307         5.71
   49774.591     0.850000         4432         6.67
   51118.079     0.875000         4565         8.00
   51544.063     0.887500         4634         8.89
   52002.815     0.900000         4696        10.00
   52625.407     0.912500         4761        11.43
   53411.839     0.925000         4823        13.33
   53903.359     0.937500         4888        16.00
   54198.271     0.943750         4922        17.78
   54460.415     0.950000         4956        20.00
   54755.327     0.956250         4985        22.86
   55083.007     0.962500         5020        26.67
   55443.455     0.968750         5053        32.00
   55541.759     0.971875         5067        35.56
   55705.599     0.975000         5085        40.00
   55836.671     0.978125         5103        45.71
   56033.279     0.981250         5119        53.33
   56229.887     0.984375         5139        64.00
   56262.655     0.985938         5143        71.11
   56295.423     0.987500         5149        80.00
   56360.959     0.989062         5162        91.43
   56393.727     0.990625         5165       106.67
   56492.031     0.992188         5174       128.00
   56524.799     0.992969         5178       142.22
   56557.567     0.993750         5183       160.00
   56655.871     0.994531         5188       182.86
   56688.639     0.995313         5190       213.33
   56754.175     0.996094         5193       256.00
   56786.943     0.996484         5199       284.44
   56786.943     0.996875         5199       320.00
   56786.943     0.997266         5199       365.71
   56819.711     0.997656         5201       426.67
   56885.247     0.998047         5203       512.00
   56950.783     0.998242         5206       568.89
   56950.783     0.998437         5206       640.00
   56950.783     0.998633         5206       731.43
   56983.551     0.998828         5208       853.33
   56983.551     0.999023         5208      1024.00
   57016.319     0.999121         5209      1137.78
   57016.319     0.999219         5209      1280.00
   57147.391     0.999316         5211      1462.86
   57147.391     0.999414         5211      1706.67
   57147.391     0.999512         5211      2048.00
   57147.391     0.999561         5211      2275.56
   57147.391     0.999609         5211      2560.00
   57278.463     0.999658         5212      2925.71
   57278.463     0.999707         5212      3413.33
   57278.463     0.999756         5212      4096.00
   57278.463     0.999780         5212      4551.11
   57278.463     0.999805         5212      5120.00
   57704.447     0.999829         5213      5851.43
   57704.447     1.000000         5213          inf
#[Mean    =    33459.610, StdDeviation   =    13478.929]
#[Max     =    57671.680, Total count    =         5213]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6195 requests in 1.00m, 6.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 7998
Requests/sec:    103.08
Transfer/sec:    103.21MB
------------------------500--DONE------------------------